Autodesk.Revit.DB.SubfaceType
Since:
2012
Meaning of a subface's type.
Since:
2012

Autodesk.Revit.DB.SubfaceType.Side
Any face which does not meet the criteria to be Top or Bottom.

Autodesk.Revit.DB.SubfaceType.Top
A horizontal top face of the room as defined by the room's level and height, or a face of the
room that is bounded above by a room-bounding element.

Autodesk.Revit.DB.SubfaceType.Bottom
A horizontal face at the bottom of the room, as defined by the room's level and base offset, or
a face of the room that is bounded below by a room-bounding element.